src/DataProcessors/ФормированиеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеНачислений</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Карта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Documents/НачислениеБезнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>НачислениеБезнал</Name>
			<Comment>на безналичный счет клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Неплательщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаКредита</Name>
					<Comment>при оплате безналом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Web</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВГостинице</Name>
					<Comment>для стыковки с гостиничной системой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВГостинице</Name>
					<Comment>для стыковки с гостиничной системой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграниченияВариантовОплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийПоСписку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедоступенВыборИзСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчаствуетВРассылках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерныйСписок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдТрактиръМобайл</Name>
					<Comment>внутренний ид на сервере ТрактиръМобайл</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеВариантыОплаты</Name>
					<Comment>для неплательщиков и безнала</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничениеПериод</Name>
							<Comment>0 - нет, 1 - день, 2 - неделя, 3 - месяц</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничениеСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПринадлежностьКатегориям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ФормированиеНачислений/Forms/Форма/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МОДУЛЯ

Процедура УправлениеВидимостью()
	ВидимостьКонтрагента = ОбъектЗаполнения = "Контрагент";
	ЭлементыФормы.НадписьКонтрагент.Видимость = ВидимостьКонтрагента;
	ЭлементыФормы.Контрагент.Видимость        = ВидимостьКонтрагента;
	
	ВидимостьНомера = ОбъектЗаполнения = "Номера";
	ЭлементыФормы.НадписьНомера.Видимость = ВидимостьНомера;
	ЭлементыФормы.НомерС.Видимость 		  = ВидимостьНомера;
	ЭлементыФормы.НадписьПо.Видимость     = ВидимостьНомера;
	ЭлементыФормы.НомерПо.Видимость		  = ВидимостьНомера;
	
	ВидимостьСумма = Не (ОбъектЗаполнения = "Минус" ИЛИ ОбъектЗаполнения = "Плюс");
	ЭлементыФормы.Надпись1.Видимость     = ВидимостьСумма;
	ЭлементыФормы.СуммаНаКарту.Видимость = ВидимостьСумма;
КонецПроцедуры

Процедура СформироватьКомментарий()
	ЭлементыФормы.Всего.Заголовок = "Всего начислено (удержано) на сумму: " + Клиенты.Итог("Сумма"); 	
КонецПроцедуры

Функция ПолучитьОстатокПоКлиенту(Момент, Клиент)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Клиент", Клиент);
	Возврат 0;	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	ОбъектЗаполнения = ЭлементыФормы.ОбъектЗаполнения.СписокВыбора.НайтиПоЗначению("Контрагент").Значение;
	Дата = ТекущаяДата();
	УправлениеВидимостью();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ОбъектЗаполненияПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

Процедура ЗаполнитьНажатие(Элемент)
	
	Если Клиенты.Количество() > 0 Тогда
		Ответ = Вопрос("Текущий список клиентов будет очищен!", РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		Иначе
			Клиенты.Очистить();
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбъектЗаполнения = "Контрагент" Тогда
		Если Не ЗначениеЗаполнено(Контрагент) Тогда
			Сообщить("Не выбран контрагент");
			Возврат;
		КонецЕсли;	
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Клиенты.Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	НЕ Клиенты.ПометкаУдаления
		|	И Клиенты.Безнал
		|	И Клиенты.Контрагент = &Контрагент
		|"); 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Стр = Клиенты.Добавить();
			Стр.Клиент  = Выборка.Ссылка;
			Стр.Карта   = КартаПоПривязке(Выборка.Ссылка).Код;
			Стр.Остаток = ПолучитьОстатокПоКлиенту(Дата, Выборка.Ссылка);
			Стр.Сумма   = СуммаНаКарту;
		КонецЦикла;	
		
	ИначеЕсли ОбъектЗаполнения = "Номера" Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КартыДоступа.Привязка КАК Ссылка,
		|	КартыДоступа.Код
		|ИЗ
		|	Справочник.КартыДоступа КАК КартыДоступа
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И Код МЕЖДУ &Код1 И &Код2
		|");
		
		Запрос.УстановитьПараметр("Код1", НомерС);
		Запрос.УстановитьПараметр("Код2", НомерПо);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.Клиенты") И Выборка.Ссылка.Безнал Тогда
				Стр = Клиенты.Добавить();
				Стр.Клиент  = Выборка.Ссылка;
				Стр.Карта   = Выборка.Код;
				Стр.Остаток = ПолучитьОстатокПоКлиенту(Дата, Выборка.Ссылка);
				Стр.Сумма   = СуммаНаКарту;
			КонецЕсли;
		КонецЦикла;	
		
	ИначеЕсли ОбъектЗаполнения = "Минус" Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	НакопленияКлиентовОстатки.Клиент,
		|	НакопленияКлиентовОстатки.СуммаБезналОстаток,
		|	КартыДоступа.Код
		|ИЗ
		|	РегистрНакопления.НакопленияКлиентов.Остатки(&Дата, ) КАК НакопленияКлиентовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыДоступа КАК КартыДоступа
		|		ПО НакопленияКлиентовОстатки.Клиент = КартыДоступа.Привязка
		|ГДЕ
		|	НакопленияКлиентовОстатки.СуммаБезналОстаток < 0");
		Запрос.УстановитьПараметр("Дата",Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Стр = Клиенты.Добавить();
			Стр.Клиент  = Выборка.Клиент;
			Стр.Карта   = Выборка.Код;
			Стр.Остаток = Выборка.СуммаБезналОстаток;
			Стр.Сумма   = - Выборка.СуммаБезналОстаток;
		КонецЦикла;	
		
	ИначеЕсли ОбъектЗаполнения = "Плюс" Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	НакопленияКлиентовОстатки.Клиент,
		|	НакопленияКлиентовОстатки.СуммаБезналОстаток,
		|	КартыДоступа.Код
		|ИЗ
		|	РегистрНакопления.НакопленияКлиентов.Остатки(&Дата, ) КАК НакопленияКлиентовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыДоступа КАК КартыДоступа
		|		ПО НакопленияКлиентовОстатки.Клиент = КартыДоступа.Привязка
		|ГДЕ
		|	НакопленияКлиентовОстатки.СуммаБезналОстаток > 0");
		Запрос.УстановитьПараметр("Дата",Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Стр = Клиенты.Добавить();
			Стр.Клиент  = Выборка.Клиент;
			Стр.Карта   = Выборка.Код;
			Стр.Остаток = Выборка.СуммаБезналОстаток;
			Стр.Сумма   = - Выборка.СуммаБезналОстаток;
		КонецЦикла;
	КонецЕсли;	
	
	СформироватьКомментарий();	
КонецПроцедуры

Процедура КлиентыСуммаПриИзменении(Элемент)
	СформироватьКомментарий(); 
КонецПроцедуры

Процедура КлиентыКлиентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.Значение) Тогда
		Стр = ЭлементыФормы.Клиенты.ТекущиеДанные;
		Стр.Карта = КартаПоПривязке(Элемент.Значение).Код;
		Стр.Остаток = ПолучитьОстатокПоКлиенту(Дата, Элемент.Значение);
	КонецЕсли;
КонецПроцедуры

Процедура КлиентыПослеУдаления(Элемент)
	СформироватьКомментарий();
КонецПроцедуры

Процедура ДатаПриИзменении(Элемент)
	Для Каждого Стр Из Клиенты Цикл
		Стр.Остаток = ПолучитьОстатокПоКлиенту(Дата, Стр.Клиент);	
	КонецЦикла;	
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если Клиенты.Количество() = 0 Тогда
		Сообщить("Не указан ни один клиент!");
		Возврат;
	КонецЕсли;	
	
	Для Каждого Стр Из Клиенты Цикл
		Если  Не ЗначениеЗаполнено(Стр.Клиент) Тогда
			Сообщить("Не указан клиент. Строка " + (Клиенты.Индекс(Стр) + 1));
			Возврат;		
		КонецЕсли;
		
		Если Стр.Сумма = 0 Тогда
			Сообщить("Не указана сумма. Строка " + (Клиенты.Индекс(Стр) + 1));
			Возврат;
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого Стр Из Клиенты Цикл
		Сообщить("Обрабатывается элемент - " + Стр.Клиент);
		Документ = Документы.НачислениеБезнал.СоздатьДокумент();
		
		Документ.Дата = Дата;           
		Документ.Клиент = Стр.Клиент;
		Документ.Сумма = Стр.Сумма;
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось выполнить обработку: " + ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;	
	
	Сообщить("Обработка завершена!");
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ЭлементыФормы.ОбъектЗаполнения.СписокВыбора.Добавить("Контрагент", "По контрагенту");
ЭлементыФормы.ОбъектЗаполнения.СписокВыбора.Добавить("Номера"    , "По диапазону номеров карт");
ЭлементыФормы.ОбъектЗаполнения.СписокВыбора.Добавить("Минус"     , "Обнуление задолженности клиентов");
ЭлементыФормы.ОбъектЗаполнения.СписокВыбора.Добавить("Плюс"      , "Обнуление задолженности перед клиентами");
